garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F47Q10.PIC
        <edc:SFRDef edc:access="n---nnnn" edc:cname="CLC2POL" edc:desc="Polarity control" edc:impl="0x8f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0---uuuu" edc:name="CLC2POL" edc:nzwidth="8" edc:por="0---xxxx" edc:_modsrc="DOS-02286_cla_clc_v5_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xE32">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1POL" edc:desc="" edc:mask="0x1" edc:name="G1POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2POL" edc:desc="" edc:mask="0x1" edc:name="G2POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3POL" edc:desc="" edc:mask="0x1" edc:name="G3POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4POL" edc:desc="" edc:mask="0x1" edc:name="G4POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC2G1POL" edc:desc="" edc:mask="0x1" edc:name="LC2G1POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC2G2POL" edc:desc="" edc:mask="0x1" edc:name="LC2G2POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC2G3POL" edc:desc="" edc:mask="0x1" edc:name="LC2G3POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC2G4POL" edc:desc="" edc:mask="0x1" edc:name="LC2G4POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="LC2POL" edc:desc="" edc:mask="0x1" edc:name="LC2POL" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC2SEL0" edc:desc="Input select register 1" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC2SEL0" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_cla_clc_v5_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xE33">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="D1S" edc:desc="" edc:mask="0xff" edc:name="D1S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC2D1S" edc:mask="0xff" edc:name="LC2D1S" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="D1S0" edc:desc="" edc:mask="0x1" edc:name="D1S0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D1S1" edc:desc="" edc:mask="0x1" edc:name="D1S1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D1S2" edc:desc="" edc:mask="0x1" edc:name="D1S2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D1S3" edc:desc="" edc:mask="0x1" edc:name="D1S3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D1S4" edc:desc="" edc:mask="0x1" edc:name="D1S4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D1S5" edc:desc="" edc:mask="0x1" edc:name="D1S5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D1S6" edc:desc="" edc:mask="0x1" edc:name="D1S6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D1S7" edc:desc="" edc:mask="0x1" edc:name="D1S7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="LC2D1S0" edc:mask="0x1" edc:name="LC2D1S0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC2D1S1" edc:mask="0x1" edc:name="LC2D1S1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC2D1S2" edc:mask="0x1" edc:name="LC2D1S2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC2D1S3" edc:mask="0x1" edc:name="LC2D1S3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC2D1S4" edc:mask="0x1" edc:name="LC2D1S4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC2D1S5" edc:mask="0x1" edc:name="LC2D1S5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC2D1S6" edc:mask="0x1" edc:name="LC2D1S6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC2D1S7" edc:mask="0x1" edc:name="LC2D1S7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC2SEL1" edc:desc="Input select register 1" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC2SEL1" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_cla_clc_v5_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xE34">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="D2S" edc:desc="" edc:mask="0xff" edc:name="D2S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC2D2S" edc:mask="0xff" edc:name="LC2D2S" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="D2S0" edc:mask="0x1" edc:name="D2S0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D2S1" edc:mask="0x1" edc:name="D2S1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D2S2" edc:mask="0x1" edc:name="D2S2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D2S3" edc:mask="0x1" edc:name="D2S3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D2S4" edc:mask="0x1" edc:name="D2S4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D2S5" edc:mask="0x1" edc:name="D2S5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D2S6" edc:mask="0x1" edc:name="D2S6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D2S7" edc:mask="0x1" edc:name="D2S7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="LC2D2S0" edc:mask="0x1" edc:name="LC2D2S0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC2D2S1" edc:mask="0x1" edc:name="LC2D2S1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC2D2S2" edc:mask="0x1" edc:name="LC2D2S2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC2D2S3" edc:mask="0x1" edc:name="LC2D2S3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC2D2S4" edc:mask="0x1" edc:name="LC2D2S4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC2D2S5" edc:mask="0x1" edc:name="LC2D2S5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC2D2S6" edc:mask="0x1" edc:name="LC2D2S6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC2D2S7" edc:mask="0x1" edc:name="LC2D2S7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
