garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F47Q10.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC3SEL2" edc:desc="Input select register 1" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC3SEL2" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_cla_clc_v5_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xE3F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="D3S" edc:desc="" edc:mask="0xff" edc:name="D3S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC3D3S" edc:mask="0xff" edc:name="LC3D3S" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="D3S0" edc:mask="0x1" edc:name="D3S0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D3S1" edc:mask="0x1" edc:name="D3S1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D3S2" edc:mask="0x1" edc:name="D3S2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D3S3" edc:mask="0x1" edc:name="D3S3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D3S4" edc:mask="0x1" edc:name="D3S4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D3S5" edc:mask="0x1" edc:name="D3S5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D3S6" edc:mask="0x1" edc:name="D3S6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D3S7" edc:mask="0x1" edc:name="D3S7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="LC3D3S0" edc:mask="0x1" edc:name="LC3D3S0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC3D3S1" edc:mask="0x1" edc:name="LC3D3S1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC3D3S2" edc:mask="0x1" edc:name="LC3D3S2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC3D3S3" edc:mask="0x1" edc:name="LC3D3S3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC3D3S4" edc:mask="0x1" edc:name="LC3D3S4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC3D3S5" edc:mask="0x1" edc:name="LC3D3S5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC3D3S6" edc:mask="0x1" edc:name="LC3D3S6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC3D3S7" edc:mask="0x1" edc:name="LC3D3S7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC3SEL3" edc:desc="Input select register 1" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC3SEL3" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_cla_clc_v5_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xE40">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="D4S" edc:desc="" edc:mask="0xff" edc:name="D4S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC3D4S" edc:mask="0xff" edc:name="LC3D4S" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="D4S0" edc:mask="0x1" edc:name="D4S0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D4S1" edc:mask="0x1" edc:name="D4S1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D4S2" edc:mask="0x1" edc:name="D4S2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D4S3" edc:mask="0x1" edc:name="D4S3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D4S4" edc:mask="0x1" edc:name="D4S4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D4S5" edc:mask="0x1" edc:name="D4S5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D4S6" edc:mask="0x1" edc:name="D4S6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D4S7" edc:mask="0x1" edc:name="D4S7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="LC3D4S0" edc:mask="0x1" edc:name="LC3D4S0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC3D4S1" edc:mask="0x1" edc:name="LC3D4S1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC3D4S2" edc:mask="0x1" edc:name="LC3D4S2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC3D4S3" edc:mask="0x1" edc:name="LC3D4S3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC3D4S4" edc:mask="0x1" edc:name="LC3D4S4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC3D4S5" edc:mask="0x1" edc:name="LC3D4S5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC3D4S6" edc:mask="0x1" edc:name="LC3D4S6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC3D4S7" edc:mask="0x1" edc:name="LC3D4S7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC3GLS0" edc:desc="Gate logic select register 0" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC3GLS0" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_cla_clc_v5_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xE41">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1D1N" edc:desc="" edc:mask="0x1" edc:name="G1D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1D1T" edc:desc="" edc:mask="0x1" edc:name="G1D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1D2N" edc:desc="" edc:mask="0x1" edc:name="G1D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1D2T" edc:desc="" edc:mask="0x1" edc:name="G1D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1D3N" edc:desc="" edc:mask="0x1" edc:name="G1D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1D3T" edc:desc="" edc:mask="0x1" edc:name="G1D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1D4N" edc:desc="" edc:mask="0x1" edc:name="G1D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1D4T" edc:desc="" edc:mask="0x1" edc:name="G1D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC3G1D1N" edc:desc="" edc:mask="0x1" edc:name="LC3G1D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G1D1T" edc:desc="" edc:mask="0x1" edc:name="LC3G1D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G1D2N" edc:desc="" edc:mask="0x1" edc:name="LC3G1D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G1D2T" edc:desc="" edc:mask="0x1" edc:name="LC3G1D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G1D3N" edc:desc="" edc:mask="0x1" edc:name="LC3G1D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G1D3T" edc:desc="" edc:mask="0x1" edc:name="LC3G1D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G1D4N" edc:desc="" edc:mask="0x1" edc:name="LC3G1D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G1D4T" edc:desc="" edc:mask="0x1" edc:name="LC3G1D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
