garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F47Q10.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC3GLS1" edc:desc="Gate logic select register 1" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC3GLS1" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_cla_clc_v5_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xE42">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G2D1N" edc:desc="" edc:mask="0x1" edc:name="G2D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2D1T" edc:desc="" edc:mask="0x1" edc:name="G2D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2D2N" edc:desc="" edc:mask="0x1" edc:name="G2D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2D2T" edc:desc="" edc:mask="0x1" edc:name="G2D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2D3N" edc:desc="" edc:mask="0x1" edc:name="G2D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2D3T" edc:desc="" edc:mask="0x1" edc:name="G2D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2D4N" edc:desc="" edc:mask="0x1" edc:name="G2D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2D4T" edc:desc="" edc:mask="0x1" edc:name="G2D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC3G2D1N" edc:desc="" edc:mask="0x1" edc:name="LC3G2D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G2D1T" edc:desc="" edc:mask="0x1" edc:name="LC3G2D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G2D2N" edc:desc="" edc:mask="0x1" edc:name="LC3G2D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G2D2T" edc:desc="" edc:mask="0x1" edc:name="LC3G2D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G2D3N" edc:desc="" edc:mask="0x1" edc:name="LC3G2D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G2D3T" edc:desc="" edc:mask="0x1" edc:name="LC3G2D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G2D4N" edc:desc="" edc:mask="0x1" edc:name="LC3G2D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G2D4T" edc:desc="" edc:mask="0x1" edc:name="LC3G2D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC3GLS2" edc:desc="Gate logic select register 2" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC3GLS2" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_cla_clc_v5_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xE43">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G3D1N" edc:desc="" edc:mask="0x1" edc:name="G3D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3D1T" edc:desc="" edc:mask="0x1" edc:name="G3D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3D2N" edc:desc="" edc:mask="0x1" edc:name="G3D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3D2T" edc:desc="" edc:mask="0x1" edc:name="G3D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3D3N" edc:desc="" edc:mask="0x1" edc:name="G3D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3D3T" edc:desc="" edc:mask="0x1" edc:name="G3D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3D4N" edc:desc="" edc:mask="0x1" edc:name="G3D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3D4T" edc:desc="" edc:mask="0x1" edc:name="G3D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC3G3D1N" edc:desc="" edc:mask="0x1" edc:name="LC3G3D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G3D1T" edc:desc="" edc:mask="0x1" edc:name="LC3G3D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G3D2N" edc:desc="" edc:mask="0x1" edc:name="LC3G3D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G3D2T" edc:desc="" edc:mask="0x1" edc:name="LC3G3D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G3D3N" edc:desc="" edc:mask="0x1" edc:name="LC3G3D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G3D3T" edc:desc="" edc:mask="0x1" edc:name="LC3G3D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G3D4N" edc:desc="" edc:mask="0x1" edc:name="LC3G3D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G3D4T" edc:desc="" edc:mask="0x1" edc:name="LC3G3D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC3GLS3" edc:desc="Gate logic select register 3" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC3GLS3" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_cla_clc_v5_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xE44">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G4D1N" edc:desc="" edc:mask="0x1" edc:name="G4D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D1T" edc:desc="" edc:mask="0x1" edc:name="G4D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D2N" edc:desc="" edc:mask="0x1" edc:name="G4D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D2T" edc:desc="" edc:mask="0x1" edc:name="G4D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D3N" edc:desc="" edc:mask="0x1" edc:name="G4D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D3T" edc:desc="" edc:mask="0x1" edc:name="G4D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D4N" edc:desc="" edc:mask="0x1" edc:name="G4D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D4T" edc:desc="" edc:mask="0x1" edc:name="G4D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC3G4D1N" edc:mask="0x1" edc:name="LC3G4D1N" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC3G4D1T" edc:mask="0x1" edc:name="LC3G4D1T" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC3G4D2N" edc:mask="0x1" edc:name="LC3G4D2N" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC3G4D2T" edc:mask="0x1" edc:name="LC3G4D2T" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC3G4D3N" edc:mask="0x1" edc:name="LC3G4D3N" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC3G4D3T" edc:mask="0x1" edc:name="LC3G4D3T" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC3G4D4N" edc:mask="0x1" edc:name="LC3G4D4N" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC3G4D4T" edc:mask="0x1" edc:name="LC3G4D4T" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-rnnnnn" edc:cname="CLC4CON" edc:desc="Configurable logic cell control" edc:impl="0xbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000" edc:name="CLC4CON" edc:nzwidth="8" edc:por="0-000000" edc:_modsrc="DOS-02286_cla_clc_v5_8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xE45">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x7" edc:name="MODE" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="INTN" edc:desc="" edc:mask="0x1" edc:name="INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INTP" edc:desc="" edc:mask="0x1" edc:name="INTP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MODE0" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="LC4MODE" edc:desc="" edc:mask="0x7" edc:name="LC4MODE" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="LC4INTN" edc:desc="" edc:mask="0x1" edc:name="LC4INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4INTP" edc:desc="" edc:mask="0x1" edc:name="LC4INTP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4OUT" edc:desc="" edc:mask="0x1" edc:name="LC4OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LC4EN" edc:desc="" edc:mask="0x1" edc:name="LC4EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="LC4MODE0" edc:mask="0x1" edc:name="LC4MODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC4MODE1" edc:mask="0x1" edc:name="LC4MODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC4MODE2" edc:mask="0x1" edc:name="LC4MODE2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n---nnnn" edc:cname="CLC4POL" edc:desc="Polarity control" edc:impl="0x8f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0---uuuu" edc:name="CLC4POL" edc:nzwidth="8" edc:por="0---xxxx" edc:_modsrc="DOS-02286_cla_clc_v5_8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xE46">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1POL" edc:desc="" edc:mask="0x1" edc:name="G1POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2POL" edc:desc="" edc:mask="0x1" edc:name="G2POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3POL" edc:desc="" edc:mask="0x1" edc:name="G3POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4POL" edc:desc="" edc:mask="0x1" edc:name="G4POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC4G1POL" edc:desc="" edc:mask="0x1" edc:name="LC4G1POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4G2POL" edc:desc="" edc:mask="0x1" edc:name="LC4G2POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4G3POL" edc:desc="" edc:mask="0x1" edc:name="LC4G3POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4G4POL" edc:desc="" edc:mask="0x1" edc:name="LC4G4POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="LC4POL" edc:desc="" edc:mask="0x1" edc:name="LC4POL" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC4SEL0" edc:desc="Input select register 1" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC4SEL0" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_cla_clc_v5_8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xE47">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="D1S" edc:desc="" edc:mask="0xff" edc:name="D1S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC4D1S" edc:mask="0xff" edc:name="LC4D1S" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="D1S0" edc:desc="" edc:mask="0x1" edc:name="D1S0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D1S1" edc:desc="" edc:mask="0x1" edc:name="D1S1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D1S2" edc:desc="" edc:mask="0x1" edc:name="D1S2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D1S3" edc:desc="" edc:mask="0x1" edc:name="D1S3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D1S4" edc:desc="" edc:mask="0x1" edc:name="D1S4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D1S5" edc:desc="" edc:mask="0x1" edc:name="D1S5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D1S6" edc:desc="" edc:mask="0x1" edc:name="D1S6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D1S7" edc:desc="" edc:mask="0x1" edc:name="D1S7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="LC4D1S0" edc:mask="0x1" edc:name="LC4D1S0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC4D1S1" edc:mask="0x1" edc:name="LC4D1S1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC4D1S2" edc:mask="0x1" edc:name="LC4D1S2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC4D1S3" edc:mask="0x1" edc:name="LC4D1S3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC4D1S4" edc:mask="0x1" edc:name="LC4D1S4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC4D1S5" edc:mask="0x1" edc:name="LC4D1S5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC4D1S6" edc:mask="0x1" edc:name="LC4D1S6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC4D1S7" edc:mask="0x1" edc:name="LC4D1S7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC4SEL1" edc:desc="Input select register 1" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC4SEL1" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_cla_clc_v5_8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xE48">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="D2S" edc:desc="" edc:mask="0xff" edc:name="D2S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC4D2S" edc:mask="0xff" edc:name="LC4D2S" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="D2S0" edc:mask="0x1" edc:name="D2S0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D2S1" edc:mask="0x1" edc:name="D2S1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D2S2" edc:mask="0x1" edc:name="D2S2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D2S3" edc:mask="0x1" edc:name="D2S3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D2S4" edc:mask="0x1" edc:name="D2S4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D2S5" edc:mask="0x1" edc:name="D2S5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D2S6" edc:mask="0x1" edc:name="D2S6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D2S7" edc:mask="0x1" edc:name="D2S7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="LC4D2S0" edc:mask="0x1" edc:name="LC4D2S0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC4D2S1" edc:mask="0x1" edc:name="LC4D2S1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC4D2S2" edc:mask="0x1" edc:name="LC4D2S2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC4D2S3" edc:mask="0x1" edc:name="LC4D2S3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC4D2S4" edc:mask="0x1" edc:name="LC4D2S4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC4D2S5" edc:mask="0x1" edc:name="LC4D2S5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC4D2S6" edc:mask="0x1" edc:name="LC4D2S6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC4D2S7" edc:mask="0x1" edc:name="LC4D2S7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC4SEL2" edc:desc="Input select register 1" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC4SEL2" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_cla_clc_v5_8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xE49">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="D3S" edc:desc="" edc:mask="0xff" edc:name="D3S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC4D3S" edc:mask="0xff" edc:name="LC4D3S" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="D3S0" edc:mask="0x1" edc:name="D3S0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D3S1" edc:mask="0x1" edc:name="D3S1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D3S2" edc:mask="0x1" edc:name="D3S2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D3S3" edc:mask="0x1" edc:name="D3S3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D3S4" edc:mask="0x1" edc:name="D3S4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D3S5" edc:mask="0x1" edc:name="D3S5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D3S6" edc:mask="0x1" edc:name="D3S6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D3S7" edc:mask="0x1" edc:name="D3S7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="LC4D3S0" edc:mask="0x1" edc:name="LC4D3S0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC4D3S1" edc:mask="0x1" edc:name="LC4D3S1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC4D3S2" edc:mask="0x1" edc:name="LC4D3S2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC4D3S3" edc:mask="0x1" edc:name="LC4D3S3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC4D3S4" edc:mask="0x1" edc:name="LC4D3S4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC4D3S5" edc:mask="0x1" edc:name="LC4D3S5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC4D3S6" edc:mask="0x1" edc:name="LC4D3S6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC4D3S7" edc:mask="0x1" edc:name="LC4D3S7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC4SEL3" edc:desc="Input select register 1" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC4SEL3" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_cla_clc_v5_8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xE4A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="D4S" edc:desc="" edc:mask="0xff" edc:name="D4S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC4D4S" edc:mask="0xff" edc:name="LC4D4S" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="D4S0" edc:mask="0x1" edc:name="D4S0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D4S1" edc:mask="0x1" edc:name="D4S1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D4S2" edc:mask="0x1" edc:name="D4S2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D4S3" edc:mask="0x1" edc:name="D4S3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D4S4" edc:mask="0x1" edc:name="D4S4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D4S5" edc:mask="0x1" edc:name="D4S5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D4S6" edc:mask="0x1" edc:name="D4S6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D4S7" edc:mask="0x1" edc:name="D4S7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="LC4D4S0" edc:mask="0x1" edc:name="LC4D4S0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC4D4S1" edc:mask="0x1" edc:name="LC4D4S1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC4D4S2" edc:mask="0x1" edc:name="LC4D4S2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC4D4S3" edc:mask="0x1" edc:name="LC4D4S3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC4D4S4" edc:mask="0x1" edc:name="LC4D4S4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC4D4S5" edc:mask="0x1" edc:name="LC4D4S5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC4D4S6" edc:mask="0x1" edc:name="LC4D4S6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC4D4S7" edc:mask="0x1" edc:name="LC4D4S7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
