garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F47Q10.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC7SEL0" edc:desc="Input select register 1" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC7SEL0" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_cla_clc_v5_8bit.Module" edc:_refcount="7" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xE65">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="D1S" edc:desc="" edc:mask="0xff" edc:name="D1S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC7D1S" edc:mask="0xff" edc:name="LC7D1S" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="D1S0" edc:desc="" edc:mask="0x1" edc:name="D1S0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D1S1" edc:desc="" edc:mask="0x1" edc:name="D1S1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D1S2" edc:desc="" edc:mask="0x1" edc:name="D1S2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D1S3" edc:desc="" edc:mask="0x1" edc:name="D1S3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D1S4" edc:desc="" edc:mask="0x1" edc:name="D1S4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D1S5" edc:desc="" edc:mask="0x1" edc:name="D1S5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D1S6" edc:desc="" edc:mask="0x1" edc:name="D1S6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D1S7" edc:desc="" edc:mask="0x1" edc:name="D1S7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="LC7D1S0" edc:mask="0x1" edc:name="LC7D1S0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC7D1S1" edc:mask="0x1" edc:name="LC7D1S1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC7D1S2" edc:mask="0x1" edc:name="LC7D1S2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC7D1S3" edc:mask="0x1" edc:name="LC7D1S3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC7D1S4" edc:mask="0x1" edc:name="LC7D1S4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC7D1S5" edc:mask="0x1" edc:name="LC7D1S5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC7D1S6" edc:mask="0x1" edc:name="LC7D1S6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC7D1S7" edc:mask="0x1" edc:name="LC7D1S7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC7SEL1" edc:desc="Input select register 1" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC7SEL1" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_cla_clc_v5_8bit.Module" edc:_refcount="7" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xE66">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="D2S" edc:desc="" edc:mask="0xff" edc:name="D2S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC7D2S" edc:mask="0xff" edc:name="LC7D2S" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="D2S0" edc:mask="0x1" edc:name="D2S0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D2S1" edc:mask="0x1" edc:name="D2S1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D2S2" edc:mask="0x1" edc:name="D2S2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D2S3" edc:mask="0x1" edc:name="D2S3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D2S4" edc:mask="0x1" edc:name="D2S4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D2S5" edc:mask="0x1" edc:name="D2S5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D2S6" edc:mask="0x1" edc:name="D2S6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D2S7" edc:mask="0x1" edc:name="D2S7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="LC7D2S0" edc:mask="0x1" edc:name="LC7D2S0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC7D2S1" edc:mask="0x1" edc:name="LC7D2S1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC7D2S2" edc:mask="0x1" edc:name="LC7D2S2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC7D2S3" edc:mask="0x1" edc:name="LC7D2S3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC7D2S4" edc:mask="0x1" edc:name="LC7D2S4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC7D2S5" edc:mask="0x1" edc:name="LC7D2S5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC7D2S6" edc:mask="0x1" edc:name="LC7D2S6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC7D2S7" edc:mask="0x1" edc:name="LC7D2S7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC7SEL2" edc:desc="Input select register 1" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC7SEL2" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_cla_clc_v5_8bit.Module" edc:_refcount="7" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xE67">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="D3S" edc:desc="" edc:mask="0xff" edc:name="D3S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC7D3S" edc:mask="0xff" edc:name="LC7D3S" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="D3S0" edc:mask="0x1" edc:name="D3S0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D3S1" edc:mask="0x1" edc:name="D3S1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D3S2" edc:mask="0x1" edc:name="D3S2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D3S3" edc:mask="0x1" edc:name="D3S3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D3S4" edc:mask="0x1" edc:name="D3S4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D3S5" edc:mask="0x1" edc:name="D3S5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D3S6" edc:mask="0x1" edc:name="D3S6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D3S7" edc:mask="0x1" edc:name="D3S7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="LC7D3S0" edc:mask="0x1" edc:name="LC7D3S0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC7D3S1" edc:mask="0x1" edc:name="LC7D3S1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC7D3S2" edc:mask="0x1" edc:name="LC7D3S2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC7D3S3" edc:mask="0x1" edc:name="LC7D3S3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC7D3S4" edc:mask="0x1" edc:name="LC7D3S4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC7D3S5" edc:mask="0x1" edc:name="LC7D3S5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC7D3S6" edc:mask="0x1" edc:name="LC7D3S6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC7D3S7" edc:mask="0x1" edc:name="LC7D3S7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC7SEL3" edc:desc="Input select register 1" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC7SEL3" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_cla_clc_v5_8bit.Module" edc:_refcount="7" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xE68">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="D4S" edc:desc="" edc:mask="0xff" edc:name="D4S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC7D4S" edc:mask="0xff" edc:name="LC7D4S" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="D4S0" edc:mask="0x1" edc:name="D4S0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D4S1" edc:mask="0x1" edc:name="D4S1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D4S2" edc:mask="0x1" edc:name="D4S2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D4S3" edc:mask="0x1" edc:name="D4S3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D4S4" edc:mask="0x1" edc:name="D4S4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D4S5" edc:mask="0x1" edc:name="D4S5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D4S6" edc:mask="0x1" edc:name="D4S6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D4S7" edc:mask="0x1" edc:name="D4S7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="LC7D4S0" edc:mask="0x1" edc:name="LC7D4S0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC7D4S1" edc:mask="0x1" edc:name="LC7D4S1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC7D4S2" edc:mask="0x1" edc:name="LC7D4S2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC7D4S3" edc:mask="0x1" edc:name="LC7D4S3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC7D4S4" edc:mask="0x1" edc:name="LC7D4S4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC7D4S5" edc:mask="0x1" edc:name="LC7D4S5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC7D4S6" edc:mask="0x1" edc:name="LC7D4S6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC7D4S7" edc:mask="0x1" edc:name="LC7D4S7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
