garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F47Q10.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="IPR4" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111" edc:name="IPR4" edc:nzwidth="8" edc:por="--111111" edc:_addr="0xEB9">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR1IP" edc:mask="0x1" edc:name="TMR1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR2IP" edc:mask="0x1" edc:name="TMR2IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3IP" edc:mask="0x1" edc:name="TMR3IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR4IP" edc:mask="0x1" edc:name="TMR4IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5IP" edc:mask="0x1" edc:name="TMR5IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR6IP" edc:mask="0x1" edc:name="TMR6IP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-nnn" edc:cname="IPR5" edc:desc="" edc:impl="0xf7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1111-111" edc:name="IPR5" edc:nzwidth="8" edc:por="1111-111" edc:_addr="0xEBA">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR1GIP" edc:mask="0x1" edc:name="TMR1GIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3GIP" edc:mask="0x1" edc:name="TMR3GIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5GIP" edc:mask="0x1" edc:name="TMR5GIP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC1IP" edc:mask="0x1" edc:name="CLC1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC2IP" edc:mask="0x1" edc:name="CLC2IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC3IP" edc:mask="0x1" edc:name="CLC3IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC4IP" edc:mask="0x1" edc:name="CLC4IP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn--nn" edc:cname="IPR6" edc:desc="" edc:impl="0xf3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1111--11" edc:name="IPR6" edc:nzwidth="8" edc:por="1111--11" edc:_addr="0xEBB">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP1IP" edc:mask="0x1" edc:name="CCP1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2IP" edc:mask="0x1" edc:name="CCP2IP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="CLC5IP" edc:mask="0x1" edc:name="CLC5IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC6IP" edc:mask="0x1" edc:name="CLC6IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC7IP" edc:mask="0x1" edc:name="CLC7IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC8IP" edc:mask="0x1" edc:name="CLC8IP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn----n" edc:cname="IPR7" edc:desc="" edc:impl="0xe1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="111----1" edc:name="IPR7" edc:nzwidth="8" edc:por="111----1" edc:_addr="0xEBC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CWGIP" edc:mask="0x1" edc:name="CWGIP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="NVMIP" edc:mask="0x1" edc:name="NVMIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CRCIP" edc:mask="0x1" edc:name="CRCIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCANIP" edc:mask="0x1" edc:name="SCANIP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CWG1IP" edc:mask="0x1" edc:name="CWG1IP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nn-nnn" edc:cname="PIE0" edc:desc="" edc:impl="0x37" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--00-000" edc:name="PIE0" edc:nzwidth="8" edc:por="--00-000" edc:_addr="0xEBD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT0IE" edc:mask="0x1" edc:name="INT0IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1IE" edc:mask="0x1" edc:name="INT1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT2IE" edc:mask="0x1" edc:name="INT2IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCIE" edc:mask="0x1" edc:name="IOCIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0IE" edc:mask="0x1" edc:name="TMR0IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn----nn" edc:cname="PIE1" edc:desc="" edc:impl="0xc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00----00" edc:name="PIE1" edc:nzwidth="8" edc:por="00----00" edc:_addr="0xEBE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADIE" edc:mask="0x1" edc:name="ADIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADTIE" edc:mask="0x1" edc:name="ADTIE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="CSWIE" edc:mask="0x1" edc:name="CSWIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OSCFIE" edc:mask="0x1" edc:name="OSCFIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn----nn" edc:cname="PIE2" edc:desc="" edc:impl="0xc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00----00" edc:name="PIE2" edc:nzwidth="8" edc:por="00----00" edc:_addr="0xEBF">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C1IE" edc:mask="0x1" edc:name="C1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C2IE" edc:mask="0x1" edc:name="C2IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="ZCDIE" edc:mask="0x1" edc:name="ZCDIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HLVDIE" edc:mask="0x1" edc:name="HLVDIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
