garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F47Q10.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="WDTCON0" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--qqqqq0" edc:name="WDTCON0" edc:nzwidth="8" edc:por="--qqqqq0" edc:_modsrc="DOS-02448_wdt_windowed_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0xECD">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEN" edc:desc="" edc:mask="0x1" edc:name="SEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPS" edc:desc="" edc:mask="0x1f" edc:name="WDTPS" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SWDTEN" edc:desc="" edc:mask="0x1" edc:name="SWDTEN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="WDTSEN" edc:desc="" edc:mask="0x1" edc:name="WDTSEN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="WDTPS0" edc:desc="" edc:mask="0x1" edc:name="WDTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPS1" edc:desc="" edc:mask="0x1" edc:name="WDTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPS2" edc:desc="" edc:mask="0x1" edc:name="WDTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPS3" edc:desc="" edc:mask="0x1" edc:name="WDTPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPS4" edc:desc="" edc:mask="0x1" edc:name="WDTPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnn-nnn" edc:cname="WDTCON1" edc:desc="" edc:impl="0x77" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-qqq-qqq" edc:name="WDTCON1" edc:nzwidth="8" edc:por="-qqq-qqq" edc:_modsrc="DOS-02448_wdt_windowed_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0xECE">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WINDOW" edc:desc="" edc:mask="0x7" edc:name="WINDOW" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="WDTCS" edc:desc="" edc:mask="0x7" edc:name="WDTCS" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="WINDOW0" edc:desc="" edc:mask="0x1" edc:name="WINDOW0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WINDOW1" edc:desc="" edc:mask="0x1" edc:name="WINDOW1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WINDOW2" edc:desc="" edc:mask="0x1" edc:name="WINDOW2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="WDTWINDOW" edc:desc="" edc:mask="0x7" edc:name="WDTWINDOW" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="WDTWINDOW0" edc:desc="" edc:mask="0x1" edc:name="WDTWINDOW0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTWINDOW1" edc:desc="" edc:mask="0x1" edc:name="WDTWINDOW1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTWINDOW2" edc:desc="" edc:mask="0x1" edc:name="WDTWINDOW2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="WDTCS0" edc:desc="" edc:mask="0x1" edc:name="WDTCS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTCS1" edc:desc="" edc:mask="0x1" edc:name="WDTCS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTCS2" edc:desc="" edc:mask="0x1" edc:name="WDTCS2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="WDTPSL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="WDTPSL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02448_wdt_windowed_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0xECF">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PSCNT" edc:desc="" edc:mask="0xff" edc:name="PSCNT" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PSCNT0" edc:desc="" edc:mask="0x1" edc:name="PSCNT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSCNT1" edc:desc="" edc:mask="0x1" edc:name="PSCNT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSCNT2" edc:desc="" edc:mask="0x1" edc:name="PSCNT2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSCNT3" edc:desc="" edc:mask="0x1" edc:name="PSCNT3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSCNT4" edc:desc="" edc:mask="0x1" edc:name="PSCNT4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSCNT5" edc:desc="" edc:mask="0x1" edc:name="PSCNT5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSCNT6" edc:desc="" edc:mask="0x1" edc:name="PSCNT6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSCNT7" edc:desc="" edc:mask="0x1" edc:name="PSCNT7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="WDTPSCNT" edc:desc="" edc:mask="0xff" edc:name="WDTPSCNT" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="WDTPSCNT0" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPSCNT1" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPSCNT2" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPSCNT3" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPSCNT4" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPSCNT5" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPSCNT6" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPSCNT7" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
