garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F47Q10.PIC
        <edc:SFRDef edc:access="----nnnn" edc:cname="MDSRC" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="MDSRC" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02566_txm_mod_v3_xxK40_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0xF4E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SRCS0" edc:mask="0x1" edc:name="SRCS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SRCS1" edc:mask="0x1" edc:name="SRCS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SRCS2" edc:mask="0x1" edc:name="SRCS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SRCS3" edc:mask="0x1" edc:name="SRCS3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="SRCS" edc:mask="0xf" edc:name="SRCS" edc:nzwidth="0x4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MDSRCS" edc:mask="0xf" edc:name="MDSRCS" edc:nzwidth="0x4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="MDSRCS0" edc:mask="0x1" edc:name="MDSRCS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDSRCS1" edc:mask="0x1" edc:name="MDSRCS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDSRCS2" edc:mask="0x1" edc:name="MDSRCS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDSRCS3" edc:mask="0x1" edc:name="MDSRCS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="MDCARL" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="MDCARL" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-02566_txm_mod_v3_xxK40_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0xF4F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLS" edc:mask="0x7" edc:name="CLS" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MDCLS" edc:mask="0x7" edc:name="MDCLS" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="MDCLS0" edc:mask="0x1" edc:name="MDCLS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDCLS1" edc:mask="0x1" edc:name="MDCLS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDCLS2" edc:mask="0x1" edc:name="MDCLS2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="CLS0" edc:mask="0x1" edc:name="CLS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLS1" edc:mask="0x1" edc:name="CLS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLS2" edc:mask="0x1" edc:name="CLS2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="MDCARH" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="MDCARH" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-02566_txm_mod_v3_xxK40_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0xF50">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CHS" edc:desc="" edc:mask="0x7" edc:name="CHS" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="CHS0" edc:mask="0x1" edc:name="CHS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CHS1" edc:mask="0x1" edc:name="CHS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CHS2" edc:mask="0x1" edc:name="CHS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MDCHS" edc:mask="0x7" edc:name="MDCHS" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="MDCHS0" edc:mask="0x1" edc:name="MDCHS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDCHS1" edc:mask="0x1" edc:name="MDCHS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDCHS2" edc:mask="0x1" edc:name="MDCHS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="ADACT" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="ADACT" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-02639_adc_sarcore_mp_ctrl_v1_xxK40_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0xF51">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADACT" edc:desc="" edc:mask="0x1f" edc:name="ADACT" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADACT0" edc:desc="" edc:mask="0x1" edc:name="ADACT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACT1" edc:desc="" edc:mask="0x1" edc:name="ADACT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACT2" edc:desc="" edc:mask="0x1" edc:name="ADACT2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACT3" edc:desc="" edc:mask="0x1" edc:name="ADACT3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACT4" edc:desc="" edc:mask="0x1" edc:name="ADACT4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="ADCLK" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="ADCLK" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02639_adc_sarcore_mp_ctrl_v1_xxK40_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0xF52">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCS" edc:desc="" edc:mask="0x3f" edc:name="ADCS" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADCS0" edc:mask="0x1" edc:name="ADCS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCS1" edc:mask="0x1" edc:name="ADCS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCS2" edc:mask="0x1" edc:name="ADCS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCS3" edc:mask="0x1" edc:name="ADCS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCS4" edc:mask="0x1" edc:name="ADCS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCS5" edc:mask="0x1" edc:name="ADCS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---n--nn" edc:cname="ADREF" edc:desc="" edc:impl="0x13" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---0--00" edc:name="ADREF" edc:nzwidth="8" edc:por="---0--00" edc:_modsrc="DOS-02639_adc_sarcore_mp_ctrl_v1_xxK40_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0xF53">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADPREF" edc:desc="" edc:mask="0x3" edc:name="ADPREF" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ADNREF" edc:desc="" edc:mask="0x1" edc:name="ADNREF" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADPREF0" edc:desc="" edc:mask="0x1" edc:name="ADPREF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPREF1" edc:desc="" edc:mask="0x1" edc:name="ADPREF1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
